# ==============================================================================
# Brewfile — Réinstallation macOS
# Usage : brew bundle install --file=Brewfile
# ==============================================================================

# --- Dépendances ---
brew "mas"
brew "git"
brew "curl"
cask "macfuse"
mas "Xcode", id: 497799835

# --- Sécurité & Confidentialité ---
cask "1password"
cask "cryptomator"
cask "lulu"
cask "mullvad-vpn"
cask "tailscale-app"

# --- Navigateurs ---
cask "brave-browser"
cask "google-chrome"
cask "librewolf"

# --- Productivité ---
cask "alfred"
cask "cardhop"
cask "chatgpt"
cask "claude"
cask "claude-code"
cask "dropbox"
cask "fantastical"
cask "notion"
cask "obsidian"
cask "qspace-pro"
cask "todoist-app"
cask "updf"

# --- Communication ---
cask "discord"
cask "readdle-spark"
cask "teamviewer"
cask "textual"
cask "zoom"

# --- Développement ---
cask "ghostty"
cask "visual-studio-code"

# --- Terminal ---
brew "starship"                 # prompt
cask "font-meslo-lg-nerd-font"  # police
brew "zsh-autosuggestions"      # suggestions historique
brew "zsh-syntax-highlighting"  # coloration syntaxique
brew "zsh-completions"          # complétions étendues
brew "topgrade"                 # mises à jour globales
brew "zoxide"                   # remplace `cd`
brew "eza"                      # remplace `ls`
brew "bat"                      # remplace `cat`
brew "fd"                       # remplace `find`
brew "ripgrep"                  # remplace `grep`
brew "jq"                       # manipulation JSON
brew "tldr"                     # man pages simplifiées
brew "htop"                     # monitoring process
brew "tree"                     # arborescence dossiers
brew "wget"                     # complément curl
brew "pyenv"                    # gestion versions Python
brew "nvm"                      # gestion versions Node
brew "gh"                       # CLI Github
brew "lazygit"                  # UI Git dans le terminal
brew "delta"                    # remplace le diff de Git

# --- Médias ---
cask "audio-hijack"
cask "calibre"
cask "iina"
cask "iptvnator"
cask "mediainfo"
cask "plex"
cask "spotify"
cask "vlc"

# --- Utilitaires ---
cask "alcove"
cask "alt-tab"
cask "appcleaner"
cask "cleanshot"
cask "cork"
cask "cyberduck"
cask "hazel"
cask "hookmark"
cask "keepingyouawake"
cask "keka"
cask "maccy"
cask "qbittorrent"
cask "pika"
cask "rectangle"
cask "sidenotes"
cask "soulver"
cask "thaw"
cask "tomatobar"
cask "yoink"

# --- Finance & Trading ---
cask "tradingview"

# --- Microsoft Office ---
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "onedrive"

# --- Gaming ---
cask "steam"

